Extensions/ИнтеграцияGreenApi/InformationRegisters/омг_НастройкиИнтеграцииСЛИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>омг_НастройкиИнтеграцииСЛИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПозицииИсключенияИзОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПозицииИсключенияИзОповещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_РаботыСФиксированнымВременемЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_РаботыСФиксированнымВременемЗаписи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ОповещенияПоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ОповещенияПоВремени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_СтатусыПодтвержденияСтрокЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_СтатусыПодтвержденияСтрокЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыПодтвержденияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ЗаписиКОповещению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ЗаписиКОповещению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыПодтвержденияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ШаблоныСообщенийПоВрачамИРаботам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ШаблоныСообщенийПоВрачамИРаботам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КартинкаШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ДополнительныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмПодготовки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ЯзыкиЧатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АлгоритмПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПлановыеОповещенияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПлановыеОповещенияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмПередОповещением</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ПакетыОповещенийПоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ВидыПредопределенныхШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ВидыПредопределенныхШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НоваяЗаписьСПодробностями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоваяЗаписьБезПодробностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОповещениеОЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОбОтменеБезОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическоеСообщениеОбОтмене</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОбОтмене</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Заявка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>омг_БезЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НесколькоСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСостоянийЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>омг_БезЗаписиНесколькоВрачей</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Продолжительность</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>омг_Набор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/CommonModules/iga_НапоминанияВызовСервера/Ext/Module.bsl
Процедура ЗафиксироватьНапоминанияВРегистре(Заявка, ЧатСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_НастройкиИнтеграцииСЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |ПОМЕСТИТЬ ВТ_ПропускаемыеПозиции
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	iga_ПозицииИсключенияИзОповещений.Номенклатура
	               |ИЗ
	               |	РегистрСведений.iga_ПозицииИсключенияИзОповещений КАК iga_ПозицииИсключенияИзОповещений
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкаРаботы.Ссылка КАК Ссылка,
	               |	ЗаявкаРаботы.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ЗаявкаРаботы.Номенклатура.Наименование, ""Прием"") КАК НоменклатураНаименование,
	               |	ВЫБОР
	               |		КОГДА ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |			ТОГДА ЗаявкаРаботы.ДатаНачала
	               |		ИНАЧЕ ЗаявкаРаботы.Ссылка.ДатаНачала
	               |	КОНЕЦ КАК ДатаНачала,
	               |	ЕСТЬNULL(ЗаявкаРаботы.Сотрудник.Ссылка, ЗаявкаРаботы.Ссылка.Сотрудник) КАК Сотрудник
	               |ПОМЕСТИТЬ ВТ_ВсеБудущиеЗаписи
	               |ИЗ
	               |	Документ.Заявка.Работы КАК ЗаявкаРаботы
	               |ГДЕ
	               |	(НЕ ЗаявкаРаботы.Ссылка.омг_БезЗаписи
	               |				И НЕ ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |			ИЛИ НЕ ЗаявкаРаботы.омг_БезЗаписиНесколькоВрачей
	               |				И ЗаявкаРаботы.Ссылка.НесколькоСотрудников)
	               |	И ЗаявкаРаботы.Ссылка.ДатаНачала >= &Дата
	               |	И НЕ ЗаявкаРаботы.Номенклатура В ИЕРАРХИИ
	               |				(ВЫБРАТЬ
	               |					ВТ_ПропускаемыеПозиции.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |				ИЗ
	               |					ВТ_ПропускаемыеПозиции КАК ВТ_ПропускаемыеПозиции)
	               |	И ЗаявкаРаботы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |	ВложенныйЗапрос.ДатаНачала КАК ДатаНачала,
	               |	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(iga_РаботыСФиксированнымВременемЗаписи.Время, НЕОПРЕДЕЛЕНО) КАК ФиксВремяРаботы
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ВсеБудущиеЗаписи.Ссылка КАК Ссылка,
	               |		МИНИМУМ(ВТ_ВсеБудущиеЗаписи.ДатаНачала) КАК ДатаНачала,
	               |		ВТ_ВсеБудущиеЗаписи.Сотрудник КАК Сотрудник,
	               |		ВТ_ВсеБудущиеЗаписи.Номенклатура КАК Номенклатура
	               |	ИЗ
	               |		ВТ_ВсеБудущиеЗаписи КАК ВТ_ВсеБудущиеЗаписи
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ВТ_ВсеБудущиеЗаписи.Ссылка КАК Ссылка,
	               |				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВсеБудущиеЗаписи.Номенклатура) КАК КоличествоСтрок
	               |			ИЗ
	               |				ВТ_ВсеБудущиеЗаписи КАК ВТ_ВсеБудущиеЗаписи
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ВТ_ВсеБудущиеЗаписи.Ссылка) КАК ВложенныйЗапрос
	               |			ПО ВТ_ВсеБудущиеЗаписи.Ссылка = ВложенныйЗапрос.Ссылка
	               |	ГДЕ
	               |		(ВТ_ВсеБудущиеЗаписи.Номенклатура.Ссылка ЕСТЬ NULL
	               |					И ВложенныйЗапрос.КоличествоСтрок = 1
	               |				ИЛИ НЕ ВТ_ВсеБудущиеЗаписи.Номенклатура.Ссылка ЕСТЬ NULL
	               |					И ВложенныйЗапрос.КоличествоСтрок >= 1)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ВсеБудущиеЗаписи.Сотрудник,
	               |		ВТ_ВсеБудущиеЗаписи.Ссылка,
	               |		ВТ_ВсеБудущиеЗаписи.Номенклатура) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_РаботыСФиксированнымВременемЗаписи КАК iga_РаботыСФиксированнымВременемЗаписи
	               |		ПО (ВложенныйЗапрос.Номенклатура = iga_РаботыСФиксированнымВременемЗаписи.Работа
	               |					И НЕ iga_РаботыСФиксированнымВременемЗаписи.Работа = ЗНАЧЕНИЕ(Справочник.НОменклатура.ПустаяСсылка)
	               |				ИЛИ iga_РаботыСФиксированнымВременемЗаписи.Врач = ВложенныйЗапрос.Сотрудник)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачала
	               |ИТОГИ
	               |	МАКСИМУМ(Ссылка),
	               |	МАКСИМУМ(Сотрудник)
	               |ПО
	               |	ДатаНачала";
	ТекущаяДата = ТекущаяДата();
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата);
	ВыборкаДат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НаборЗаписей = РегистрыСведений.iga_ОповещенияПоВремени.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Заявка);
	ЗаписиРабот = РегистрыСведений.iga_СтатусыПодтвержденияСтрокЗаявок.СоздатьНаборЗаписей();
	ЗаписиРабот.Отбор.Заявка.Установить(Заявка);
	ЗанятыеДаты = Новый Массив;
	
	
	Пока ВыборкаДат.Следующий() Цикл
		
		ДатаНачала = ВыборкаДат.ДатаНачала;
		
		Документы.Заявка.ЗаписатьОповещениеПоВремени(НаборЗаписей, ЗанятыеДаты, ЧатСсылка, Заявка, ДатаНачала, ТекущаяДата);
		
		iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ЧатСсылка, "ОтправленоОповещение", Истина);
		
		ВыборкаРаботы = ВыборкаДат.Выбрать();
		
		ТребуетсяПодтверждение = Ложь;
		
		Для Каждого ЗаписьОповещения Из НаборЗаписей Цикл
			Если ЗаписьОповещения.ТребуетсяПодтверждение Тогда
				ТребуетсяПодтверждение = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ТребуетсяПодтверждение  Тогда
			Пока ВыборкаРаботы.Следующий() Цикл
				Запись = ЗаписиРабот.Добавить();
				Запись.Заявка = Заявка;
				Запись.Работа = ВыборкаРаботы.Номенклатура;
				
				Если Не ВыборкаРаботы.ФиксВремяРаботы = Неопределено Тогда
					ДатаЗаписи = НачалоДня(ДатаНачала) + (ВыборкаРаботы.ФиксВремяРаботы - Дата(1,1,1));
				Иначе
					ДатаЗаписи = ДатаНачала;
				КонецЕсли;
		
				Запись.ДатаЗаписи = ДатаЗаписи;
			КонецЦикла;
		КонецЕсли;
		
		
	КонецЦикла;
	
	ЗаписиРабот.Записать();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОповеститьОЗаписиНаСервере(ПараметрыОповещения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ПараметрыОповещения.ЧатСсылка, "Язык", ПараметрыОповещения.ЯзыкЧата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	iga_ПодразделенияОператоров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.iga_ПодразделенияОператоров.Филиалы КАК iga_ПодразделенияОператоров
	|ГДЕ
	|	iga_ПодразделенияОператоров.Филиал = &Филиал";
	Запрос.УстановитьПараметр("Филиал", ПараметрыОповещения.Филиал);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет подразделения оператора для филиала заявки.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
    ПодразделениеОператора = Выборка.Ссылка;
	
	Запись = РегистрыСведений.iga_ЗаписиКОповещению.СоздатьМенеджерЗаписи();
	Запись.Заявка = ПараметрыОповещения.Заявка;
	Запись.Прочитать();

	
	
	Отменена = ПараметрыОповещения.Состояние = Справочники.ВидыСостоянийЗаявок.Отменена;
	
	ВходящиеПараметры = Новый Структура;
	ВходящиеПараметры.Вставить("Заявка", ПараметрыОповещения.Заявка);
	
	Если Отменена Тогда
		ВидШаблона = Перечисления.iga_ВидыПредопределенныхШаблонов.СообщениеОбОтмене;
		РезультатОтправки = Справочники.iga_ШаблоныСообщений.ОтправитьСообщение(ПараметрыОповещения.ЧатСсылка, 
			ПараметрыОповещения.ЧатСсылка.Идентификатор, 
			ВидШаблона, ВходящиеПараметры);
		
		ШаблонОповещения = Справочники.iga_ШаблоныСообщений.Предопределенный(ВидШаблона, ПараметрыОповещения.ЯзыкЧата);
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаявкаРаботы.Ссылка КАК Ссылка,
		               |	ЗаявкаРаботы.НомерСтроки КАК НомерСтроки,
		               |	iga_ШаблоныСообщенийПоВрачамИРаботам.ШаблонСообщения КАК ШаблонСообщения,
		               |	iga_ШаблоныСообщенийПоВрачамИРаботам.АлгоритмПроверки КАК АлгоритмПроверки,
		               |	ВЫБОР
		               |		КОГДА iga_ШаблоныСообщенийПоВрачамИРаботам.АлгоритмПроверки <> ЗНАЧЕНИЕ(Справочник.iga_Алгоритмы.ПустаяСсылка)
		               |			ТОГДА 0
		               |		ИНАЧЕ 100
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА iga_ШаблоныСообщенийПоВрачамИРаботам.Филиал = ЗНАЧЕНИЕ(Справочник.Филиалы.ПустаяСсылка)
		               |			ТОГДА 9
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА iga_ШаблоныСообщенийПоВрачамИРаботам.Врач = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		               |			ТОГДА 8
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА iga_ШаблоныСообщенийПоВрачамИРаботам.Работа = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		               |			ТОГДА 7
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА iga_ШаблоныСообщенийПоВрачамИРаботам.Язык = &ЯзыкЧата
		               |			ТОГДА 0
		               |		ИНАЧЕ 10
		               |	КОНЕЦ КАК ПорядокПриоритета,
		               |	iga_ШаблоныСообщенийПоВрачамИРаботам.КартинкаШаблона КАК КартинкаШаблона,
		               |	iga_ШаблоныСообщенийПоВрачамИРаботам.АлгоритмПодготовки КАК АлгоритмПодготовки,
		               |	ЕСТЬNULL(iga_РаботыСФиксированнымВременемЗаписи.Время, НЕОПРЕДЕЛЕНО) КАК ФиксВремя
		               |ИЗ
		               |	Документ.Заявка.Работы КАК ЗаявкаРаботы
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
		               |		ПО ЗаявкаРаботы.Ссылка = Заявка.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_ШаблоныСообщенийПоВрачамИРаботам КАК iga_ШаблоныСообщенийПоВрачамИРаботам
		               |		ПО (iga_ШаблоныСообщенийПоВрачамИРаботам.Филиал = Заявка.Филиал
		               |				ИЛИ iga_ШаблоныСообщенийПоВрачамИРаботам.Филиал = ЗНАЧЕНИЕ(Справочник.Филиалы.ПустаяСсылка))
		               |			И (iga_ШаблоныСообщенийПоВрачамИРаботам.Врач = Заявка.Сотрудник
		               |				ИЛИ iga_ШаблоныСообщенийПоВрачамИРаботам.Врач = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
		               |			И (iga_ШаблоныСообщенийПоВрачамИРаботам.Работа = ЗаявкаРаботы.Номенклатура
		               |				ИЛИ iga_ШаблоныСообщенийПоВрачамИРаботам.Работа = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		               |			И (iga_ШаблоныСообщенийПоВрачамИРаботам.Язык = &ЯзыкЧата
		               |				ИЛИ iga_ШаблоныСообщенийПоВрачамИРаботам.Язык = ЗНАЧЕНИЕ(Справочник.iga_ЯзыкиЧатов.ПустаяСсылка))
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_РаботыСФиксированнымВременемЗаписи КАК iga_РаботыСФиксированнымВременемЗаписи
		               |		ПО (ЗаявкаРаботы.Номенклатура = iga_РаботыСФиксированнымВременемЗаписи.Работа
		               |					И НЕ iga_РаботыСФиксированнымВременемЗаписи.Работа = ЗНАЧЕНИЕ(Справочник.НОменклатура.ПустаяСсылка)
		               |				ИЛИ (ЗаявкаРаботы.Сотрудник = iga_РаботыСФиксированнымВременемЗаписи.Врач
		               |					ИЛИ Заявка.Сотрудник = iga_РаботыСФиксированнымВременемЗаписи.Врач)
		               |					И НЕ iga_РаботыСФиксированнымВременемЗаписи.Врач = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
		               |ГДЕ
		               |	ЗаявкаРаботы.Ссылка = &Заявка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерСтроки,
		               |	ПорядокПриоритета
		               |АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Заявка", ПараметрыОповещения.Заявка);
		Запрос.УстановитьПараметр("ЯзыкЧата", ПараметрыОповещения.ЯзыкЧата);
		Запрос.УстановитьПараметр("ПустойЯзыкЧата", Справочники.iga_ЯзыкиЧатов.ПустаяСсылка());
		ВыборкаШаблоновРабот = Запрос.Выполнить().Выбрать();
		
		Если ПараметрыОповещения.СообщениеБезПодробностей Тогда
			ВидШаблона = Перечисления.iga_ВидыПредопределенныхШаблонов.НоваяЗаписьБезПодробностей;
			РезультатОтправки = Справочники.iga_ШаблоныСообщений.ОтправитьСообщение(ПараметрыОповещения.ЧатСсылка, 
				ПараметрыОповещения.ЧатСсылка.Идентификатор, 
				ВидШаблона, ВходящиеПараметры);
			
			ШаблонОповещения = Справочники.iga_ШаблоныСообщений.Предопределенный(ВидШаблона, ПараметрыОповещения.ЯзыкЧата);
			
		Иначе
			
			СпециальныйШаблон = Неопределено;
			ФиксВремя = Неопределено;
			
			ОбработчикАлгоритмов = Обработки.iga_ОбработчикЭтапов.Создать();
			ОбработчикАлгоритмов.ВходящиеПараметры = Новый Структура("Заявка", ПараметрыОповещения.Заявка);
			
			Пока ВыборкаШаблоновРабот.Следующий() Цикл
				
				Если ВыборкаШаблоновРабот.АлгоритмПроверки.Пустая() Тогда
					СпециальныйШаблон = ВыборкаШаблоновРабот.ШаблонСообщения;
					КартинкаШаблона = ВыборкаШаблоновРабот.КартинкаШаблона;
					ФиксВремя = ВыборкаШаблоновРабот.ФиксВремя;
					
					Если Не ВыборкаШаблоновРабот.АлгоритмПодготовки.Пустая() Тогда
						ВходящиеПараметры.Вставить("АлгоритмПодготовки", ВыборкаШаблоновРабот.АлгоритмПодготовки);
					КонецЕсли;
					
					Прервать;
				КонецЕсли;   
				
				ПроверкаПройдена = ОбработчикАлгоритмов.ВыполнитьАлгоритмВИсключении(ВыборкаШаблоновРабот.АлгоритмПроверки);
				Если ПроверкаПройдена Тогда
					СпециальныйШаблон = ВыборкаШаблоновРабот.ШаблонСОобщения;
					КартинкаШаблона = ВыборкаШаблоновРабот.КартинкаШаблона;
					ФиксВремя = ВыборкаШаблоновРабот.ФиксВремя;
					Если Не ВыборкаШаблоновРабот.АлгоритмПодготовки.Пустая() Тогда
						ВходящиеПараметры.Вставить("АлгоритмПодготовки", ВыборкаШаблоновРабот.АлгоритмПодготовки);
					КонецЕсли;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если СпециальныйШаблон = Неопределено Тогда
				
				ВидШаблона = Перечисления.iga_ВидыПредопределенныхШаблонов.НоваяЗаписьСПодробностями;
				РезультатОтправки = Справочники.iga_ШаблоныСообщений.ОтправитьСообщение(ПараметрыОповещения.ЧатСсылка, 
					ПараметрыОповещения.ЧатСсылка.Идентификатор, 
					ВидШаблона, ВходящиеПараметры);
				
				ШаблонОповещения = Справочники.iga_ШаблоныСообщений.Предопределенный(ВидШаблона, ПараметрыОповещения.ЯзыкЧата);
			Иначе
				
				ВходящиеПараметры.Вставить("ФиксВремя", ФиксВремя);
                
				РезультатОтправки = Справочники.iga_ШаблоныСообщений.ОтправитьСообщение(ПараметрыОповещения.ЧатСсылка, 
					ПараметрыОповещения.ЧатСсылка.Идентификатор, 
					СпециальныйШаблон, ВходящиеПараметры,, КартинкаШаблона);
					ШаблонОповещения = СпециальныйШаблон;
				
			КонецЕсли;
		КонецЕсли;
		
		ЗафиксироватьНапоминанияВРегистре(ПараметрыОповещения.Заявка, ПараметрыОповещения.ЧатСсылка);
	КонецЕсли;
	Если РезультатОтправки = Неопределено Тогда
		
		ВызватьИсключение("Не удалось отправить оповещение! Обратитесь к администратору.");
		
		Возврат;
	КонецЕсли;
	
	ЗаписьОповещенияПоВремени = РегистрыСведений.iga_ОповещенияПоВремени.СоздатьМенеджерЗаписи();
	ЗаписьОповещенияПоВремени.Заявка = ПараметрыОповещения.Заявка;
	ЗаписьОповещенияПоВремени.ДатаЗаписи = ПараметрыОповещения.ДатаПервойЗаписи;
	ЗаписьОповещенияПоВремени.ДатаОповещения = ТекущаяДата();
	ЗаписьОповещенияПоВремени.ТребуетсяПодтверждение = Ложь;
	ЗаписьОповещенияПоВремени.Выполнено = Истина;
	ЗаписьОповещенияПоВремени.Чат = ПараметрыОповещения.ЧатСсылка;
	ЗаписьОповещенияПоВремени.ШаблонОповещения = ШаблонОповещения;
	ЗаписьОповещенияПоВремени.Записать();
	
	
	iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ПараметрыОповещения.ЧатСсылка, "ВыбранноеПодразделение", ПодразделениеОператора);
			
	Если Не Запись.Выбран() Тогда
		Запись.Заявка = ПараметрыОповещения.Заявка;
		Запись.ДатаЗаписи = ТекущаяДата();
		Запись.Выполнено = Ложь;
	КонецЕсли;
	Запись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ВыполнитьОповещениеПакета(СтруктураОповещения, ОбработчикАлгоритмов, УстановитьОтправлено = Истина) Экспорт

	ОбработчикАлгоритмов.ВходящиеПараметры.Вставить("Заявка", СтруктураОповещения.Заявка);
	ОбработчикАлгоритмов.ВходящиеПараметры.Вставить("Чат", СтруктураОповещения.Чат);
	
	Если СтруктураОповещения.АлгоритмПередОповещением.Пустая() Тогда
		Оповестить = Истина;
	Иначе
		Оповестить = ОбработчикАлгоритмов.ВыполнитьАлгоритмВИсключении(СтруктураОповещения.АлгоритмПередОповещением);
	КонецЕсли;
	
	Если Не Оповестить = Истина И УстановитьОтправлено Тогда
		УстановитьОповещениюВыполнено(СтруктураОповещения);			
		Возврат;
	КонецЕсли;
	
	Справочники.iga_ШаблоныСообщений.ОтправитьСообщение(СтруктураОповещения.Чат, СтруктураОповещения.ИдЧата, 
	СтруктураОповещения.ШаблонОповещения, Новый Структура("Заявка", СтруктураОповещения.Заявка));
	
	ОбработчикАлгоритмов.ВыполнитьАлгоритмВИсключении(СтруктураОповещения.АлгоритмОповещения);
	
	Если УстановитьОтправлено Тогда
		УстановитьОповещениюВыполнено(СтруктураОповещения);
	КонецЕсли;
	
КонецПроцедуры


Процедура УстановитьОповещениюВыполнено(СтруктураОповещения)
	
	ЗаписьОповещения = РегистрыСведений.iga_ПлановыеОповещенияПользователей.СоздатьМенеджерЗаписи();
	ЗаписьОповещения.Заявка = СтруктураОповещения.Заявка;
	ЗаписьОповещения.ДатаОповещения = СтруктураОповещения.ДатаОповещения;
	ЗаписьОповещения.Пакет = СтруктураОповещения.Пакет;
	ЗаписьОповещения.Прочитать();
	Если ЗаписьОповещения.Выбран() Тогда
		ЗаписьОповещения.Отправлено = Истина;
		ЗаписьОповещения.Записать();
	КонецЕсли;

	
КонецПроцедуры
